In [1]:
import numpy as np

In [2]:
import matplotlib.pyplot as plt

In [3]:
%matplotlib inline

In [4]:
nwalks = 5000
nsteps = 1000
raw_steps = np.random.randint(0, 2, (nwalks, nsteps))

In [5]:
steps = np.where(raw_steps>0, 1, -1)

In [6]:
dist = steps.cumsum(1)

In [7]:
dist

array([[  1,   2,   1, ..., -52, -53, -52],
       [  1,   2,   1, ..., -18, -17, -18],
       [ -1,   0,  -1, ..., -22, -23, -24],
       ...,
       [  1,   0,  -1, ...,  44,  45,  44],
       [ -1,   0,   1, ..., -16, -17, -16],
       [  1,   0,   1, ...,  -6,  -5,  -6]])

In [8]:
dist.max()

118

In [9]:
dist.min()

-112

In [10]:
hit = (np.abs(dist)>=30).any(1)

In [11]:
hit.sum()

3379

In [26]:
import pandas as pd

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [28]:
frame = pd.DataFrame(data)`

In [29]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [30]:
pd.DataFrame?

In [33]:
frame2 = pd.DataFrame(data, columns =['year','state','pop'])

In [34]:
frame2['eastern'] = frame2.state == 'Ohio'

In [35]:
frame2

   year   state  pop  eastern
0  2000    Ohio  1.5     True
1  2001    Ohio  1.7     True
2  2002    Ohio  3.6     True
3  2001  Nevada  2.4    False
4  2002  Nevada  2.9    False
5  2003  Nevada  3.2    False

In [36]:
ser1 = frame.loc[2]
ser1

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [41]:
# странно что нельзя этим пользоваться, возможно в моменте было бы полезно
ser1['state'] = 'montana'

C:\Users\g.ermolaev\AppData\Local\Temp\ipykernel_6520\2269578990.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ser1['state'] = 'montana'

In [42]:
frame2

   year   state  pop  eastern
0  2000    Ohio  1.5     True
1  2001    Ohio  1.7     True
2  2002    Ohio  3.6     True
3  2001  Nevada  2.4    False
4  2002  Nevada  2.9    False
5  2003  Nevada  3.2    False

In [48]:
city1 = {'minsk':
         {'lenin':10, 'arch':8},
         'baranovichi':
         {'lenin':100, 'arch':0, 'people':'est\''}
        }
city2 = {'moskow':
         {'lenin':1, 'arch':10, 'people':'mnoga'},
         'piter':
         {'lenin':0, 'arch':1100, 'people':'solevie'}
        }
test_dict = {'Belarus':city1,'Russia':city2}

In [49]:
test_dict

{'Belarus': {'minsk': {'lenin': 10, 'arch': 8},
  'baranovichi': {'lenin': 100, 'arch': 0, 'people': "est'"}},
 'Russia': {'moskow': {'lenin': 1, 'arch': 10, 'people': 'mnoga'},
  'piter': {'lenin': 0, 'arch': 1100, 'people': 'solevie'}}}

In [52]:
# тестик на дважды вложенный список результат не удовлетворил ожидание
pd.DataFrame(test_dict)

,Belarus,Russia
minsk,"{'lenin': 10, 'arch': 8}",NaN
baranovichi,"{'lenin': 100, 'arch': 0, 'people': 'est''}",NaN
moskow,NaN,"{'lenin': 1, 'arch': 10, 'people': 'mnoga'}"
piter,NaN,"{'lenin': 0, 'arch': 1100, 'people': 'solevie'}"

In [53]:
frame2.T

            0     1     2       3       4       5
year     2000  2001  2002    2001    2002    2003
state    Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9     3.2
eastern  True  True  True   False   False   False

In [54]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [57]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [61]:
states = ['Texas', 'Utah', 'California']
frame.loc[['a', 'c', 'd',],states]

KeyError: "['Utah'] not in index"

In [71]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [67]:
np.arange(4., 0., -1)

array([4., 3., 2., 1.])

In [68]:
obj = pd.Series(np.arange(4., 0., -1), index=['a', 'b', 'c', 'd'])

In [70]:
obj[1]

3.0

In [76]:
#тест на :: пока не очень понятно как работает с pd.DF
frame[::3]

   Ohio  Texas  California
a     0      1           2

In [81]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.loc['Colorado', ['two', 'three']]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [85]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32